src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладскиеЯчейки</name>
  <comment>Используется при адресном хранении на складском помещении.</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьХранения</name>
    <type>
      <types>CatalogRef.ОбластиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийУчасток</name>
    <type>
      <types>CatalogRef.РабочиеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкладскойЯчейки</name>
    <type>
      <types>EnumRef.ТипыСкладскихЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <comment>Возможные значения: &quot;НеИспользовать&quot;/&quot;ИспользоватьНастройкиОбластиХранения&quot;/&quot;ИспользоватьНастройкиЯчейки&quot;</comment>
    <type>
      <types>EnumRef.ВариантыИспользованияПериодическойИнвентаризацииЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыСкладскихЯчеек/ТипыСкладскихЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкладскихЯчеек</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыИспользованияПериодическойИнвентаризацииЯчеек/ВариантыИспользованияПериодическойИнвентаризацииЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияПериодическойИнвентаризацииЯчеек</name>
  <enumValues>
    <name>НеИспользовать</name>
    <comment>Не использовать периодическую инвентаризацию ячеек</comment>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНастройкиОбластиХранения</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНастройкиЯчейки</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ОбластиХранения/ОбластиХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиХранения</name>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВСвободныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВМонотоварныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВСмешанныеЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетРазмещенияВЯчейкиСДругимТоваром</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораИзМонотоварныхЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораИзСмешанныхЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораПодОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМонотоварности</name>
    <type>
      <types>EnumRef.ОписаниеМонотоварности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрогаяМонотоварность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеПериодичностиИнвентаризацииЯчеек</name>
    <type>
      <types>EnumRef.ВариантыИспользованияПериодическойИнвентаризацииЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьОбособленногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СкладскиеЯчейки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если Не ЭтоГруппа Тогда
		
		Если ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Хранение
				И ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Архив
			Или СкладыСервер.ИспользоватьАдресноеХранениеСправочно(Владелец, Помещение)
				И НЕ СкладыСервер.ИспользоватьАдресноеХранение(Владелец, Помещение,,Ложь) Тогда
			
			ОбластьХранения 	= Справочники.ОбластиХранения.ПустаяСсылка();
			УровеньДоступности 	= 0;
			Типоразмер  		= Справочники.ТипоразмерыЯчеек.ПустаяСсылка();
			МаксимальныйКоэффициентНаполненностиПоВесу 		= 0;
			МаксимальныйКоэффициентНаполненностиПоОбъему    = 0;
			
			Если СкладыСервер.ИспользоватьАдресноеХранениеСправочно(Владелец, Помещение)
					И НЕ СкладыСервер.ИспользоватьАдресноеХранение(Владелец, Помещение,,Ложь) Тогда
				ТипСкладскойЯчейки  = Перечисления.ТипыСкладскихЯчеек.ПустаяСсылка();
			Иначе
				РабочийУчасток  	                         = Справочники.РабочиеУчастки.ПустаяСсылка();
				ОбластьХранения                              = Справочники.ОбластиХранения.ПустаяСсылка();
				ПорядокОбхода 		                         = 0;
				УровеньДоступности                           = 0;
				МаксимальныйКоэффициентНаполненностиПоВесу   = 0;
				МаксимальныйКоэффициентНаполненностиПоОбъему = 0;
			КонецЕсли;
			
		Иначе
			Если УровеньДоступности = 0 Тогда
			
				УровеньДоступности = 1;
				
			КонецЕсли;
			
			Если МаксимальныйКоэффициентНаполненностиПоВесу = 0 Тогда
				
				МаксимальныйКоэффициентНаполненностиПоВесу = 100;
				
			КонецЕсли;
			
			Если МаксимальныйКоэффициентНаполненностиПоОбъему = 0 Тогда
				
				МаксимальныйКоэффициентНаполненностиПоОбъему = 100;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СтруктураПараметров = Новый Структура("Склад,Помещение",Владелец, Помещение);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Владелец, Помещение,,Ложь) Тогда
		
		Если Не ЭтоГруппа Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТипСкладскойЯчейки");
		КонецЕсли;
		
		Если Не СкладыСервер.ИспользоватьАдресноеХранениеСправочно(Владелец, Помещение) Тогда
			
			ТекстСообщения = НСтр("ru='По складу ""%Склад%"" не используется адресное хранение!';uk='По складу ""%Склад%"" не використовується адресне зберігання!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Склад%",СкладыСервер.ПолучитьПредставлениеСклада(Владелец,Помещение));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Склад","Объект",Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Владелец) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");
		
	ИначеЕсли ЗначениеЗаполнено(Родитель) Тогда
		
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель,Новый Структура("Помещение"));
		
		Если РеквизитыРодителя.Помещение <> Помещение Тогда
			ТекстСообщения = НСтр("ru='В группе ""%Группа%"" все ячейки должны быть по помещению ""%Помещение%""';uk='У групі ""%Группа%"" всі комірки повинні бути з приміщення""%Помещение%""'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Помещение%",РеквизитыРодителя.Помещение);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Группа%",Родитель);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Помещение","Объект",Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользованиеПериодичностиИнвентаризацииЯчейки 
		<> Перечисления.ВариантыИспользованияПериодическойИнвентаризацииЯчеек.ИспользоватьНастройкиЯчейки Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоДнейМеждуИнвентаризациями");
			
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
